Revit 2024 API
ModelText.ModelTextType Property
The type for the model text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ModelTextType ModelTextType { get; set; }
Visual Basic
Public Property ModelTextType As ModelTextType
	Get
	Set
Visual C++
public:
property ModelTextType^ ModelTextType {
	ModelTextType^ get ();
	void set (ModelTextType^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when null is assigned to this property.
See Also
ModelText Class
Autodesk.Revit.DB Namespace